{"Definition": ["Determine whether an artificially constructed sentence relating to sports is plausible or not."], "Categories": ["Question Answering"], "Positive Examples": [{"input": "Is the following sentence plausible? \"Bam Adebayo scored a reverse layup in the Western Conference Finals.\"", "output": "Let's think step by step. Bam Adebayo is an American basketball player. Scoring a reverse layup in the Western Conference Finals is part of the NBA Finals. So the answer is yes."}, {"input": "Is the following sentence plausible? \"Santi Cazorla scored a touchdown.\"", "output": "Let's think step by step. Santi Cazorla is a soccer player. Touchdown is part of American football and rugby. So the answer is no."}, {"input": "Is the following sentence plausible? \"DeMar DeRozan was called for the goal tend.\"", "output": "Let's think step by step. DeMar DeRozan is an American basketball player. Goal tending is part of basketball. So the answer is yes."}], "Negative Examples": [{"input": "Is the following sentence plausible? \"Bam Adebayo scored a reverse layup in the Western Conference Finals.\"", "output": "Let's think step by step.\nFirst, we need to know who Bam Adebayo is. A quick Google search tells us that he is a professional basketball player. This is important because it means that he is physically capable of scoring a reverse layup.\nNext, we need to know what the Western Conference Finals are. A quick Google search tells us that the Western Conference Finals are the playoffs for the NBA's Western Conference. This is important because it means that Bam Adebayo would have been playing in a high-stakes game where every point matters.\nSo, taking all of this information into account, we can say that it is plausible that Bam Adebayo scored a reverse layup in the Western Conference Finals."}, {"input": "Is the following sentence plausible? \"Santi Cazorla scored a touchdown.\"", "output": "Let's think step by step.\n1. Is it plausible that Santi Cazorla could score a point in football? Yes. He is a professional athlete with good hand-eye coordination.\n2. Is it plausible that Cazorla could score a touchdown? It is not as plausible as him scoring a field goal or an extra point, but it is still possible. He could catch a touchdown pass or run the ball into the end zone.\n3. Is it plausible that Cazorla would score a touchdown for a particular team? This is where things get tricky. Cazorla is a Spanish soccer player. He has never played in a football game before, let alone for a specific team. So it is not plausible that he would score a touchdown for a particular team."}, {"input": "Is the following sentence plausible? \"DeMar DeRozan was called for the goal tend.\"", "output": "Let's think step by step.\nFirst, is it plausible that DeMar DeRozan was called for a goal? It's possible, but not very likely. It would be more plausible if he was called for a foul, but a goal is still possible.\nNext, is it plausible that the goal was tend? This seems more likely, as it would be called a goal tend if the ball was going in the basket and DeRozan was interfering.\nOverall, the sentence is plausible, but not very likely."}], "Instances": [{"id": "task1752_0", "input": "Is the following sentence plausible? \"Elias Lindholm beat the buzzer.\"", "output": ["no"]}, {"id": "task1752_1", "input": "Is the following sentence plausible? \"John Carlson scored in the third period.\"", "output": ["yes"]}, {"id": "task1752_2", "input": "Is the following sentence plausible? \"Marcelo got on the end of a through ball.\"", "output": ["yes"]}, {"id": "task1752_3", "input": "Is the following sentence plausible? \"Deshaun Watson was called for the goal tend in the Eastern Conference Finals.\"", "output": ["no"]}, {"id": "task1752_4", "input": "Is the following sentence plausible? \"Mookie Betts skated behind the net.\"", "output": ["no"]}, {"id": "task1752_5", "input": "Is the following sentence plausible? \"John Tavares earned a trip to the penalty box in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_6", "input": "Is the following sentence plausible? \"David Silva took a throw in.\"", "output": ["yes"]}, {"id": "task1752_7", "input": "Is the following sentence plausible? \"Bryce Harper hit the back shoulder fade.\"", "output": ["no"]}, {"id": "task1752_8", "input": "Is the following sentence plausible? \"Carles Puyol did a maradona on the defender.\"", "output": ["yes"]}, {"id": "task1752_9", "input": "Is the following sentence plausible? \"Robin Lehner launched the desperation heave.\"", "output": ["no"]}, {"id": "task1752_10", "input": "Is the following sentence plausible? \"Carson Wentz took to the ice.\"", "output": ["no"]}, {"id": "task1752_11", "input": "Is the following sentence plausible? \"Kwadwo Asamoah was flagged on the play.\"", "output": ["no"]}, {"id": "task1752_12", "input": "Is the following sentence plausible? \"Jack Flaherty walked to first base in the National League Championship Series.\"", "output": ["yes"]}, {"id": "task1752_13", "input": "Is the following sentence plausible? \"Jayson Tatum nutmegged the defender.\"", "output": ["no"]}, {"id": "task1752_14", "input": "Is the following sentence plausible? \"Dougie Hamilton hit the buzzer beater.\"", "output": ["no"]}, {"id": "task1752_15", "input": "Is the following sentence plausible? \"Frederik Andersen crossed the blue line in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_16", "input": "Is the following sentence plausible? \"Freddie Freeman watched the pitch go by.\"", "output": ["yes"]}, {"id": "task1752_17", "input": "Is the following sentence plausible? \"Adam Thielen scored in added time.\"", "output": ["no"]}, {"id": "task1752_18", "input": "Is the following sentence plausible? \"Tom Brady converted the first down.\"", "output": ["yes"]}, {"id": "task1752_19", "input": "Is the following sentence plausible? \"Giorgio Chiellini committed a handball in the FA Cup.\"", "output": ["yes"]}, {"id": "task1752_20", "input": "Is the following sentence plausible? \"Tyreek Hill caught the screen pass.\"", "output": ["yes"]}, {"id": "task1752_21", "input": "Is the following sentence plausible? \"Frederik Andersen took a three.\"", "output": ["no"]}, {"id": "task1752_22", "input": "Is the following sentence plausible? \"Adam Thielen got on base.\"", "output": ["no"]}, {"id": "task1752_23", "input": "Is the following sentence plausible? \"Gerard Pique scored a corner kick.\"", "output": ["yes"]}, {"id": "task1752_24", "input": "Is the following sentence plausible? \"Kailer Yamamoto performed a slide tackle in the European Cup.\"", "output": ["no"]}, {"id": "task1752_25", "input": "Is the following sentence plausible? \"Corbin Burnes earned an indirect kick.\"", "output": ["no"]}, {"id": "task1752_26", "input": "Is the following sentence plausible? \"LaMelo Ball launched the half court shot in the Western Conference Finals.\"", "output": ["yes"]}, {"id": "task1752_27", "input": "Is the following sentence plausible? \"Jonas Valanciunas beat the buzzer.\"", "output": ["yes"]}, {"id": "task1752_28", "input": "Is the following sentence plausible? \"Zach LaVine  shot the puck.\"", "output": ["no"]}, {"id": "task1752_29", "input": "Is the following sentence plausible? \"Nazem Kadri took a charge in the NBA Championship.\"", "output": ["no"]}, {"id": "task1752_30", "input": "Is the following sentence plausible? \"Delon Wright went for it on fourth down.\"", "output": ["no"]}, {"id": "task1752_31", "input": "Is the following sentence plausible? \"Malcolm Brogdon banked the shot in.\"", "output": ["yes"]}, {"id": "task1752_32", "input": "Is the following sentence plausible? \"Michael Conforto comitted a three second violation.\"", "output": ["no"]}, {"id": "task1752_33", "input": "Is the following sentence plausible? \"Jakub Vrana hit a walkoff homer.\"", "output": ["no"]}, {"id": "task1752_34", "input": "Is the following sentence plausible? \"Tom Wilson scored a penalty kick.\"", "output": ["no"]}, {"id": "task1752_35", "input": "Is the following sentence plausible? \"Aleksander Barkov passed the puck.\"", "output": ["yes"]}, {"id": "task1752_36", "input": "Is the following sentence plausible? \"Malik Beasley  comitted a three second violation.\"", "output": ["yes"]}, {"id": "task1752_37", "input": "Is the following sentence plausible? \"Draymond Green threw a touchdown.\"", "output": ["no"]}, {"id": "task1752_38", "input": "Is the following sentence plausible? \"T.Y. Hilton threw a touchdown in the AFC divisional round.\"", "output": ["yes"]}, {"id": "task1752_39", "input": "Is the following sentence plausible? \"Robert Woods converted the first down.\"", "output": ["yes"]}, {"id": "task1752_40", "input": "Is the following sentence plausible? \"Julian Edelman fumbled the ball.\"", "output": ["yes"]}, {"id": "task1752_41", "input": "Is the following sentence plausible? \"Neymar took a backhand shot in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_42", "input": "Is the following sentence plausible? \"Jonathan Marchessault scored on the power play in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_43", "input": "Is the following sentence plausible? \"Fred VanVleet scored a freekick in the Champions League Final.\"", "output": ["no"]}, {"id": "task1752_44", "input": "Is the following sentence plausible? \"Santi Cazorla called for the screen.\"", "output": ["no"]}, {"id": "task1752_45", "input": "Is the following sentence plausible? \"Edinson Cavani caught the screen pass.\"", "output": ["no"]}, {"id": "task1752_46", "input": "Is the following sentence plausible? \"DJ Chark caught the back shoulder fade in the NFC divisional round.\"", "output": ["yes"]}, {"id": "task1752_47", "input": "Is the following sentence plausible? \"Petr Cech bricked the three pointer.\"", "output": ["no"]}, {"id": "task1752_48", "input": "Is the following sentence plausible? \"Michael Porter Jr. called for the screen.\"", "output": ["yes"]}, {"id": "task1752_49", "input": "Is the following sentence plausible? \"Robert Lewandowski threw a touchdown.\"", "output": ["no"]}, {"id": "task1752_50", "input": "Is the following sentence plausible? \"Philip Rivers launched a hail mary.\"", "output": ["yes"]}, {"id": "task1752_51", "input": "Is the following sentence plausible? \"Drew Brees went for it on fourth down.\"", "output": ["yes"]}, {"id": "task1752_52", "input": "Is the following sentence plausible? \"Kevin Durant hit a walkoff homer.\"", "output": ["no"]}, {"id": "task1752_53", "input": "Is the following sentence plausible? \"Santi Cazorla earned a red card in the Champions League Final.\"", "output": ["yes"]}, {"id": "task1752_54", "input": "Is the following sentence plausible? \"Ryan Tannehill hit a triple.\"", "output": ["no"]}, {"id": "task1752_55", "input": "Is the following sentence plausible? \"Gleyber Torres got a base hit.\"", "output": ["yes"]}, {"id": "task1752_56", "input": "Is the following sentence plausible? \"Kawhi Leonard took a turnaround jumper.\"", "output": ["yes"]}, {"id": "task1752_57", "input": "Is the following sentence plausible? \"Brandin Cooks went for it on fourth down.\"", "output": ["yes"]}, {"id": "task1752_58", "input": "Is the following sentence plausible? \"Clint Capela got into the endzone.\"", "output": ["no"]}, {"id": "task1752_59", "input": "Is the following sentence plausible? \"Javier Zanetti watched the pitch go by in the National League Championship Series.\"", "output": ["no"]}, {"id": "task1752_60", "input": "Is the following sentence plausible? \"Wayne Rooney threw a touchdown in the Superbowl.\"", "output": ["no"]}, {"id": "task1752_61", "input": "Is the following sentence plausible? \"Tyler Boyd hit the screen pass in the NFC divisional round.\"", "output": ["yes"]}, {"id": "task1752_62", "input": "Is the following sentence plausible? \"Marouane Fellaini scored in extra time.\"", "output": ["yes"]}, {"id": "task1752_63", "input": "Is the following sentence plausible? \"Joao Moutinho was out at third.\"", "output": ["no"]}, {"id": "task1752_64", "input": "Is the following sentence plausible? \"Vincent Kompany comitted a three second violation.\"", "output": ["no"]}, {"id": "task1752_65", "input": "Is the following sentence plausible? \"Tuukka Rask killed the powerplay.\"", "output": ["yes"]}, {"id": "task1752_66", "input": "Is the following sentence plausible? \"Juan Soto shot from beyond the arc.\"", "output": ["no"]}, {"id": "task1752_67", "input": "Is the following sentence plausible? \"Jordan Binnington scored in the third period.\"", "output": ["yes"]}, {"id": "task1752_68", "input": "Is the following sentence plausible? \"Malcolm Brogdon drove into the restricted area in the Eastern Conference Finals.\"", "output": ["yes"]}, {"id": "task1752_69", "input": "Is the following sentence plausible? \"Didier Drogba got into the endzone.\"", "output": ["no"]}, {"id": "task1752_70", "input": "Is the following sentence plausible? \"Mike Hoffman launched the half court shot in the Western Conference Finals.\"", "output": ["no"]}, {"id": "task1752_71", "input": "Is the following sentence plausible? \"Pedro struck out the side.\"", "output": ["no"]}, {"id": "task1752_72", "input": "Is the following sentence plausible? \"Fernando Tatis Jr. earned a red card.\"", "output": ["no"]}, {"id": "task1752_73", "input": "Is the following sentence plausible? \"Evander Kane hit the slant pass in the AFC divisional round.\"", "output": ["no"]}, {"id": "task1752_74", "input": "Is the following sentence plausible? \"Igor Shesterkin launched a hail mary.\"", "output": ["no"]}, {"id": "task1752_75", "input": "Is the following sentence plausible? \"Gerrit Cole committed a handball in the European Cup.\"", "output": ["no"]}, {"id": "task1752_76", "input": "Is the following sentence plausible? \"Philip Rivers drove into the restricted area.\"", "output": ["no"]}, {"id": "task1752_77", "input": "Is the following sentence plausible? \"Norman Powell committed a blocking foul.\"", "output": ["yes"]}, {"id": "task1752_78", "input": "Is the following sentence plausible? \"Nazem Kadri was out at home.\"", "output": ["no"]}, {"id": "task1752_79", "input": "Is the following sentence plausible? \"Sterling Shepard converted the first down.\"", "output": ["yes"]}, {"id": "task1752_80", "input": "Is the following sentence plausible? \"Mario Gomez scored a reverse layup.\"", "output": ["no"]}, {"id": "task1752_81", "input": "Is the following sentence plausible? \"Andres Iniesta performed a give and go.\"", "output": ["yes"]}, {"id": "task1752_82", "input": "Is the following sentence plausible? \"Drew Brees was flagged on the play.\"", "output": ["yes"]}, {"id": "task1752_83", "input": "Is the following sentence plausible? \"Ramires scored a header goal.\"", "output": ["yes"]}, {"id": "task1752_84", "input": "Is the following sentence plausible? \"Luis Robert was out at second.\"", "output": ["yes"]}, {"id": "task1752_85", "input": "Is the following sentence plausible? \"Matthew Stafford launched a hail mary.\"", "output": ["yes"]}, {"id": "task1752_86", "input": "Is the following sentence plausible? \"T.Y. Hilton drew a flag on the play.\"", "output": ["yes"]}, {"id": "task1752_87", "input": "Is the following sentence plausible? \"Courtland Sutton hit a triple.\"", "output": ["no"]}, {"id": "task1752_88", "input": "Is the following sentence plausible? \"Mark Stone spent time in the penalty box in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_89", "input": "Is the following sentence plausible? \"Dejounte Murray took a side-step three.\"", "output": ["yes"]}, {"id": "task1752_90", "input": "Is the following sentence plausible? \"Mike Trout eurostepped to the basket.\"", "output": ["no"]}, {"id": "task1752_91", "input": "Is the following sentence plausible? \"Josh Allen hit the screen pass.\"", "output": ["yes"]}, {"id": "task1752_92", "input": "Is the following sentence plausible? \"Yaya Toure scored a freekick.\"", "output": ["yes"]}, {"id": "task1752_93", "input": "Is the following sentence plausible? \"Sean Couturier maradona'd the defender.\"", "output": ["no"]}, {"id": "task1752_94", "input": "Is the following sentence plausible? \"Mitchell Marner nutmegged the defender.\"", "output": ["no"]}, {"id": "task1752_95", "input": "Is the following sentence plausible? \"Calvin Ridley skated behind the net.\"", "output": ["no"]}, {"id": "task1752_96", "input": "Is the following sentence plausible? \"Walker Buehler earned a trip to the penalty box.\"", "output": ["no"]}, {"id": "task1752_97", "input": "Is the following sentence plausible? \"Carlos Tevez skated backwards.\"", "output": ["no"]}, {"id": "task1752_98", "input": "Is the following sentence plausible? \"Ben Simmons was called for the goal tend.\"", "output": ["yes"]}, {"id": "task1752_99", "input": "Is the following sentence plausible? \"Marvin Jones lost control of the puck.\"", "output": ["no"]}, {"id": "task1752_100", "input": "Is the following sentence plausible? \"Brad Hand hit the wheel route.\"", "output": ["no"]}, {"id": "task1752_101", "input": "Is the following sentence plausible? \"Aleksander Barkov bricked the three pointer.\"", "output": ["no"]}, {"id": "task1752_102", "input": "Is the following sentence plausible? \"Josh Allen caught the screen pass.\"", "output": ["yes"]}, {"id": "task1752_103", "input": "Is the following sentence plausible? \"Connor McDavid threw a touchdown in the NFC divisional round.\"", "output": ["no"]}, {"id": "task1752_104", "input": "Is the following sentence plausible? \"Amari Cooper scored a penalty kick.\"", "output": ["no"]}, {"id": "task1752_105", "input": "Is the following sentence plausible? \"Mario Balotelli took a left footed shot in the Champions League Final.\"", "output": ["yes"]}, {"id": "task1752_106", "input": "Is the following sentence plausible? \"Willian killed the powerplay.\"", "output": ["no"]}, {"id": "task1752_107", "input": "Is the following sentence plausible? \"Kendrick Nunn took a charge.\"", "output": ["yes"]}, {"id": "task1752_108", "input": "Is the following sentence plausible? \"Cooper Kupp scored in the third period in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_109", "input": "Is the following sentence plausible? \"Sean Couturier passed the puck in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_110", "input": "Is the following sentence plausible? \"Sterling Shepard hit a walkoff homer.\"", "output": ["no"]}, {"id": "task1752_111", "input": "Is the following sentence plausible? \"Jesus Luzardo was called for slashing.\"", "output": ["no"]}, {"id": "task1752_112", "input": "Is the following sentence plausible? \"Keenan Allen drew a flag on the play in the NFC championship.\"", "output": ["yes"]}, {"id": "task1752_113", "input": "Is the following sentence plausible? \"Jamal Murray walked on ball four.\"", "output": ["no"]}, {"id": "task1752_114", "input": "Is the following sentence plausible? \"Toni Kroos performed a give and go.\"", "output": ["yes"]}, {"id": "task1752_115", "input": "Is the following sentence plausible? \"Mitchell Trubisky caught the screen pass.\"", "output": ["yes"]}, {"id": "task1752_116", "input": "Is the following sentence plausible? \"Sergio Busquets got on base.\"", "output": ["no"]}, {"id": "task1752_117", "input": "Is the following sentence plausible? \"Domantas Sabonis gained five yards in the AFC championship.\"", "output": ["no"]}, {"id": "task1752_118", "input": "Is the following sentence plausible? \"De'Aaron Fox scored a bicycle kick.\"", "output": ["no"]}, {"id": "task1752_119", "input": "Is the following sentence plausible? \"James Harden shot from outside the eighteen.\"", "output": ["no"]}, {"id": "task1752_120", "input": "Is the following sentence plausible? \"Patrick Kane backhanded a shot in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_121", "input": "Is the following sentence plausible? \"Malcolm Brogdon eurostepped to the basket in the NBA Championship.\"", "output": ["yes"]}, {"id": "task1752_122", "input": "Is the following sentence plausible? \"James Karinchak crossed the blue line.\"", "output": ["no"]}, {"id": "task1752_123", "input": "Is the following sentence plausible? \"Joe Burrow gained five yards.\"", "output": ["yes"]}, {"id": "task1752_124", "input": "Is the following sentence plausible? \"Steven Stamkos hit the slant pass.\"", "output": ["no"]}, {"id": "task1752_125", "input": "Is the following sentence plausible? \"John Carlson entered the attacking zone in the Stanley Cup.\"", "output": ["yes"]}, {"id": "task1752_126", "input": "Is the following sentence plausible? \"Patrice Bergeron converted the first down.\"", "output": ["no"]}, {"id": "task1752_127", "input": "Is the following sentence plausible? \"Luke Voit was out at first.\"", "output": ["yes"]}, {"id": "task1752_128", "input": "Is the following sentence plausible? \"Timo Meier nutmegged the defender in the FA Cup.\"", "output": ["no"]}, {"id": "task1752_129", "input": "Is the following sentence plausible? \"Max Scherzer was safe at first.\"", "output": ["yes"]}, {"id": "task1752_130", "input": "Is the following sentence plausible? \"Eden Hazard hit the buzzer beater.\"", "output": ["no"]}, {"id": "task1752_131", "input": "Is the following sentence plausible? \"Neal Pionk shot from the six yard line.\"", "output": ["no"]}, {"id": "task1752_132", "input": "Is the following sentence plausible? \"Nick Castellanos hit the wheel route.\"", "output": ["no"]}, {"id": "task1752_133", "input": "Is the following sentence plausible? \"Tom Brady was safe at first.\"", "output": ["no"]}, {"id": "task1752_134", "input": "Is the following sentence plausible? \"Sergio Ramos hit nothing but net.\"", "output": ["no"]}, {"id": "task1752_135", "input": "Is the following sentence plausible? \"Khyri Thomas  changed direction in the backfield in the NFC championship.\"", "output": ["no"]}, {"id": "task1752_136", "input": "Is the following sentence plausible? \"Leon Draisaitl grounded out to second base in the National League Championship Series.\"", "output": ["no"]}, {"id": "task1752_137", "input": "Is the following sentence plausible? \"Bastian Schweinsteiger scored in added time.\"", "output": ["yes"]}, {"id": "task1752_138", "input": "Is the following sentence plausible? \"Aaron Nola converted the first down.\"", "output": ["no"]}, {"id": "task1752_139", "input": "Is the following sentence plausible? \"Ketel Marte got into the endzone.\"", "output": ["no"]}, {"id": "task1752_140", "input": "Is the following sentence plausible? \"Travis Konecny did a maradona on the defender.\"", "output": ["no"]}, {"id": "task1752_141", "input": "Is the following sentence plausible? \"Pierre-Luc Dubois skated backwards.\"", "output": ["yes"]}, {"id": "task1752_142", "input": "Is the following sentence plausible? \"Ryan O'Reilly wristed a shot.\"", "output": ["yes"]}, {"id": "task1752_143", "input": "Is the following sentence plausible? \"Miro Heiskanen earned a trip to the penalty box.\"", "output": ["yes"]}, {"id": "task1752_144", "input": "Is the following sentence plausible? \"Angel Di Maria scored in extra time.\"", "output": ["yes"]}, {"id": "task1752_145", "input": "Is the following sentence plausible? \"Sam Darnold scored on the power play in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_146", "input": "Is the following sentence plausible? \"Gleyber Torres scored a bicycle kick.\"", "output": ["no"]}, {"id": "task1752_147", "input": "Is the following sentence plausible? \"Tyler Glasnow scored a penalty kick.\"", "output": ["no"]}, {"id": "task1752_148", "input": "Is the following sentence plausible? \"DeVante Parker was called for icing.\"", "output": ["no"]}, {"id": "task1752_149", "input": "Is the following sentence plausible? \"Jayson Tatum was called for the goal tend.\"", "output": ["yes"]}, {"id": "task1752_150", "input": "Is the following sentence plausible? \"Carson Wentz caught the screen pass.\"", "output": ["yes"]}, {"id": "task1752_151", "input": "Is the following sentence plausible? \"Bryce Harper fumbled the ball.\"", "output": ["no"]}, {"id": "task1752_152", "input": "Is the following sentence plausible? \"Keenan Allen beat the buzzer in the Western Conference Finals.\"", "output": ["no"]}, {"id": "task1752_153", "input": "Is the following sentence plausible? \"Marcell Ozuna scored a touchdown.\"", "output": ["no"]}, {"id": "task1752_154", "input": "Is the following sentence plausible? \"Brandon Woodruff set the hard screen in the Eastern Conference Finals.\"", "output": ["no"]}, {"id": "task1752_155", "input": "Is the following sentence plausible? \"Jonas Valanciunas beat the buzzer.\"", "output": ["yes"]}, {"id": "task1752_156", "input": "Is the following sentence plausible? \"Nerlens Noel was out at home.\"", "output": ["no"]}, {"id": "task1752_157", "input": "Is the following sentence plausible? \"Paulinho earned an indirect kick in the FA Cup.\"", "output": ["yes"]}, {"id": "task1752_158", "input": "Is the following sentence plausible? \"Klaas Jan Huntelaar shot the puck.\"", "output": ["no"]}, {"id": "task1752_159", "input": "Is the following sentence plausible? \"David Pastrnak skated backwards.\"", "output": ["yes"]}, {"id": "task1752_160", "input": "Is the following sentence plausible? \"Joe Burrow caught the back shoulder fade in the Superbowl.\"", "output": ["yes"]}, {"id": "task1752_161", "input": "Is the following sentence plausible? \"Sergio Aguero maradona'd the defender.\"", "output": ["yes"]}, {"id": "task1752_162", "input": "Is the following sentence plausible? \"Gerrit Cole set the hard screen.\"", "output": ["no"]}, {"id": "task1752_163", "input": "Is the following sentence plausible? \"CJ McCollum shot from the six yard line.\"", "output": ["no"]}, {"id": "task1752_164", "input": "Is the following sentence plausible? \"Kyle Tucker took a left footed shot.\"", "output": ["no"]}, {"id": "task1752_165", "input": "Is the following sentence plausible? \"Jakub Vrana skated backwards.\"", "output": ["yes"]}, {"id": "task1752_166", "input": "Is the following sentence plausible? \"Deshaun Watson was flagged on the play.\"", "output": ["yes"]}, {"id": "task1752_167", "input": "Is the following sentence plausible? \"Tyler Glasnow watched the pitch go by.\"", "output": ["yes"]}, {"id": "task1752_168", "input": "Is the following sentence plausible? \"Juan Soto took ball four.\"", "output": ["yes"]}, {"id": "task1752_169", "input": "Is the following sentence plausible? \"Anthony Davis beat the buzzer.\"", "output": ["yes"]}, {"id": "task1752_170", "input": "Is the following sentence plausible? \"Caris LeVert scored a reverse layup.\"", "output": ["yes"]}, {"id": "task1752_171", "input": "Is the following sentence plausible? \"Andrei Svechnikov took ball four.\"", "output": ["no"]}, {"id": "task1752_172", "input": "Is the following sentence plausible? \"Trae Young got into the endzone.\"", "output": ["no"]}, {"id": "task1752_173", "input": "Is the following sentence plausible? \"Nathan MacKinnon bricked the three pointer in the Eastern Conference Finals.\"", "output": ["no"]}, {"id": "task1752_174", "input": "Is the following sentence plausible? \"A.J. Green scored in the third period.\"", "output": ["no"]}, {"id": "task1752_175", "input": "Is the following sentence plausible? \"Elias Lindholm took the snap.\"", "output": ["no"]}, {"id": "task1752_176", "input": "Is the following sentence plausible? \"Fred VanVleet passed the puck.\"", "output": ["no"]}, {"id": "task1752_177", "input": "Is the following sentence plausible? \"Frederik Andersen converted the first down.\"", "output": ["no"]}, {"id": "task1752_178", "input": "Is the following sentence plausible? \"Javier Mascherano took a left footed shot.\"", "output": ["yes"]}, {"id": "task1752_179", "input": "Is the following sentence plausible? \"Mike Trout hit a walkoff homer.\"", "output": ["yes"]}, {"id": "task1752_180", "input": "Is the following sentence plausible? \"Pete Alonso hit a triple in the World Series.\"", "output": ["yes"]}, {"id": "task1752_181", "input": "Is the following sentence plausible? \"Anthony Rizzo skated backwards in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_182", "input": "Is the following sentence plausible? \"Francisco Lindor walked on ball four.\"", "output": ["yes"]}, {"id": "task1752_183", "input": "Is the following sentence plausible? \"Klaas Jan Huntelaar scored the easy layup.\"", "output": ["no"]}, {"id": "task1752_184", "input": "Is the following sentence plausible? \"Stefon Diggs hit the slant pass.\"", "output": ["yes"]}, {"id": "task1752_185", "input": "Is the following sentence plausible? \"Diego Forlan did a maradona on the defender.\"", "output": ["yes"]}, {"id": "task1752_186", "input": "Is the following sentence plausible? \"George Springer committed a blocking foul.\"", "output": ["no"]}, {"id": "task1752_187", "input": "Is the following sentence plausible? \"Arjen Robben crossed the blue line in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_188", "input": "Is the following sentence plausible? \"Mitchell Robinson airballed the shot.\"", "output": ["yes"]}, {"id": "task1752_189", "input": "Is the following sentence plausible? \"Gabriel Landeskog launched the desperation heave.\"", "output": ["no"]}, {"id": "task1752_190", "input": "Is the following sentence plausible? \"Vincent Kompany scored a bicycle kick.\"", "output": ["yes"]}, {"id": "task1752_191", "input": "Is the following sentence plausible? \"Mathew Barzal called for the screen.\"", "output": ["no"]}, {"id": "task1752_192", "input": "Is the following sentence plausible? \"Kailer Yamamoto caught the back shoulder fade.\"", "output": ["no"]}, {"id": "task1752_193", "input": "Is the following sentence plausible? \"Patrice Bergeron took a backhand shot.\"", "output": ["yes"]}, {"id": "task1752_194", "input": "Is the following sentence plausible? \"Collin Sexton hit the buzzer beater.\"", "output": ["yes"]}, {"id": "task1752_195", "input": "Is the following sentence plausible? \"Stephan El Shaarawy shot with the left foot.\"", "output": ["yes"]}, {"id": "task1752_196", "input": "Is the following sentence plausible? \"Nick Foles lost control of the puck.\"", "output": ["no"]}, {"id": "task1752_197", "input": "Is the following sentence plausible? \"Ryan Nugent-Hopkins killed the powerplay.\"", "output": ["yes"]}, {"id": "task1752_198", "input": "Is the following sentence plausible? \"Kyle Connor eurostepped to the basket in the Western Conference Finals.\"", "output": ["no"]}, {"id": "task1752_199", "input": "Is the following sentence plausible? \"Luka Modric went in studs up in the FA Cup.\"", "output": ["yes"]}, {"id": "task1752_200", "input": "Is the following sentence plausible? \"Dani Alves took the snap.\"", "output": ["no"]}, {"id": "task1752_201", "input": "Is the following sentence plausible? \"Russell Westbrook scored on the power play.\"", "output": ["no"]}, {"id": "task1752_202", "input": "Is the following sentence plausible? \"Mark Stone hit a triple.\"", "output": ["no"]}, {"id": "task1752_203", "input": "Is the following sentence plausible? \"Teuvo Teravainen shot the puck.\"", "output": ["yes"]}, {"id": "task1752_204", "input": "Is the following sentence plausible? \"John Brown went for it on fourth down in the NFC championship.\"", "output": ["yes"]}, {"id": "task1752_205", "input": "Is the following sentence plausible? \"Kwadwo Asamoah beat the shot clock in the Eastern Conference Finals.\"", "output": ["no"]}, {"id": "task1752_206", "input": "Is the following sentence plausible? \"Kyle Tucker stepped on first base.\"", "output": ["yes"]}, {"id": "task1752_207", "input": "Is the following sentence plausible? \"Neymar did a maradona on the defender in the Champions Leage Semifinal.\"", "output": ["yes"]}, {"id": "task1752_208", "input": "Is the following sentence plausible? \"Mookie Betts took a side-step three.\"", "output": ["no"]}, {"id": "task1752_209", "input": "Is the following sentence plausible? \"Sonny Gray was out at second.\"", "output": ["yes"]}, {"id": "task1752_210", "input": "Is the following sentence plausible? \"Juan Soto did a double stepover.\"", "output": ["no"]}, {"id": "task1752_211", "input": "Is the following sentence plausible? \"Juan Mata scored a bicycle kick in the Champions League Final.\"", "output": ["yes"]}, {"id": "task1752_212", "input": "Is the following sentence plausible? \"Dylan Larkin walked on ball four.\"", "output": ["no"]}, {"id": "task1752_213", "input": "Is the following sentence plausible? \"Brandon Lowe took a left footed shot.\"", "output": ["no"]}, {"id": "task1752_214", "input": "Is the following sentence plausible? \"Caris LeVert scored a reverse dunk.\"", "output": ["yes"]}, {"id": "task1752_215", "input": "Is the following sentence plausible? \"Emmanuel Sanders got a base hit.\"", "output": ["no"]}, {"id": "task1752_216", "input": "Is the following sentence plausible? \"Robert Woods killed the powerplay.\"", "output": ["no"]}, {"id": "task1752_217", "input": "Is the following sentence plausible? \"Jonathan Marchessault went five hole.\"", "output": ["yes"]}, {"id": "task1752_218", "input": "Is the following sentence plausible? \"Tristan Jarry dunked the ball.\"", "output": ["no"]}, {"id": "task1752_219", "input": "Is the following sentence plausible? \"Wayne Rooney watched the pitch go by.\"", "output": ["no"]}, {"id": "task1752_220", "input": "Is the following sentence plausible? \"Michael Thomas took the snap.\"", "output": ["yes"]}, {"id": "task1752_221", "input": "Is the following sentence plausible? \"Deshaun Watson took a corner kick.\"", "output": ["no"]}, {"id": "task1752_222", "input": "Is the following sentence plausible? \"Mookie Betts scored on the power play.\"", "output": ["no"]}, {"id": "task1752_223", "input": "Is the following sentence plausible? \"Tuukka Rask hit a double.\"", "output": ["no"]}, {"id": "task1752_224", "input": "Is the following sentence plausible? \"Toni Kroos took a throw in in the Champions Leage Semifinal.\"", "output": ["yes"]}, {"id": "task1752_225", "input": "Is the following sentence plausible? \"Mike Williams fumbled the ball in the Superbowl.\"", "output": ["yes"]}, {"id": "task1752_226", "input": "Is the following sentence plausible? \"Allen Robinson gained five yards.\"", "output": ["yes"]}, {"id": "task1752_227", "input": "Is the following sentence plausible? \"Mario Gomez scored a reverse layup.\"", "output": ["no"]}, {"id": "task1752_228", "input": "Is the following sentence plausible? \"Juan Mata caught the screen pass.\"", "output": ["no"]}, {"id": "task1752_229", "input": "Is the following sentence plausible? \"Jamison Crowder drew a flag on the play.\"", "output": ["yes"]}, {"id": "task1752_230", "input": "Is the following sentence plausible? \"Mike Williams scored a bicycle kick in the FA Cup.\"", "output": ["no"]}, {"id": "task1752_231", "input": "Is the following sentence plausible? \"Petr Cech was safe at first.\"", "output": ["no"]}, {"id": "task1752_232", "input": "Is the following sentence plausible? \"Jayson Tatum took a side-step three in the NBA Championship.\"", "output": ["yes"]}, {"id": "task1752_233", "input": "Is the following sentence plausible? \"Thomas Muller hit a triple.\"", "output": ["no"]}, {"id": "task1752_234", "input": "Is the following sentence plausible? \"James Karinchak worked a full count.\"", "output": ["yes"]}, {"id": "task1752_235", "input": "Is the following sentence plausible? \"Jerry Jeudy killed the powerplay.\"", "output": ["no"]}, {"id": "task1752_236", "input": "Is the following sentence plausible? \"Stephen Curry scored a reverse layup.\"", "output": ["yes"]}, {"id": "task1752_237", "input": "Is the following sentence plausible? \"Mikal Bridges scored a windmill dunk.\"", "output": ["yes"]}, {"id": "task1752_238", "input": "Is the following sentence plausible? \"Ryan Fitzpatrick scored a touchdown.\"", "output": ["yes"]}, {"id": "task1752_239", "input": "Is the following sentence plausible? \"Jaylen Brown comitted a three second violation.\"", "output": ["yes"]}, {"id": "task1752_240", "input": "Is the following sentence plausible? \"Kenta Maeda caught the screen pass.\"", "output": ["no"]}, {"id": "task1752_241", "input": "Is the following sentence plausible? \"Chris Godwin crossed the blue line in the Stanley Cup.\"", "output": ["no"]}, {"id": "task1752_242", "input": "Is the following sentence plausible? \"Justin Herbert maradona'd the defender.\"", "output": ["no"]}, {"id": "task1752_243", "input": "Is the following sentence plausible? \"Blake Snell hit a single.\"", "output": ["yes"]}, {"id": "task1752_244", "input": "Is the following sentence plausible? \"Darius Slayton ran out of bounds in the AFC championship.\"", "output": ["yes"]}, {"id": "task1752_245", "input": "Is the following sentence plausible? \"Nicklas Backstrom earned a trip to the penalty box.\"", "output": ["yes"]}, {"id": "task1752_246", "input": "Is the following sentence plausible? \"Pepe converted the first down.\"", "output": ["no"]}, {"id": "task1752_247", "input": "Is the following sentence plausible? \"Kenta Maeda threw to first base in the American League Championship Series.\"", "output": ["yes"]}, {"id": "task1752_248", "input": "Is the following sentence plausible? \"Ryan O'Reilly hit the wheel route.\"", "output": ["no"]}, {"id": "task1752_249", "input": "Is the following sentence plausible? \"Marcell Ozuna hit into a double play.\"", "output": ["yes"]}]}